1s/ERP/Conf/Enums/ВариантыДействийПоРасхождениямВАктеПослеОтгрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВариантыДействийПоРасхождениямВАктеПослеОтгрузки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПокупкаПерепоставленного</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПерепоставленного</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПерепоставленноеДарится</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДопоставкаНеТребуется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетсяДопоставка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НедостачаНеПризнана</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтгрузитьСейчас</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОприходоватьСейчас</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МногооборотнаяТара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Работа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Набор</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Enums/ТипыОснованияАктаОРасхождении.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыОснованияАктаОРасхождении</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>РеализацияТоваровУслуг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриобретениеТоваровУслуг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратТоваровОтКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтгрузкаТоваровСХранения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаТоваровХранителю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриемкаТоваровНаХранение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратТоваровОтХранителя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаТоваровПереработчику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратТоваровОтПереработчика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеТоваровОтПереработчика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеОтДавальца</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаДавальцу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратДавальцу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаНаКомиссию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОтКомиссионера</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Enums/СпособыОтраженияРасхожденийАктПриемкиКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СпособыОтраженияРасхожденийАктПриемкиКлиента</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОформлениеКорректировкиКакИсправлениеПервичныхДокументов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформлениеКорректировокКакНовыеПервичныеДокументы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсправлениеПервичныхДокументов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформлениеКорректировкиПоСогласованию</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Enums/ВариантыДействийПоРасхождениямВАктеПослеОтгрузки/Forms/ФормаВыбора/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РасхожденияСервер.УправлениеСтраницамиВыборДействия(ЭтотОбъект, Параметры);
	
	ИспользоватьЗаявкиНаВозврат = ПолучитьФункциональнуюОпцию("ИспользоватьЗаявкиНаВозвратТоваровОтКлиентов");
	ИспользоватьЗаказыКлиентов = ПолучитьФункциональнуюОпцию("ИспользоватьЗаказыКлиентов");
	ИспользоватьЗаказыНаПеремещение = ПолучитьФункциональнуюОпцию("ИспользоватьЗаказыНаПеремещение");
	КоличествоУпаковокРасхождения = Параметры.КоличествоУпаковокРасхождения;
	ГрупповоеИзменение = Параметры.ГрупповоеИзменение;
	
	Если Параметры.ОтгрузкаПринципалу
		Или Не ГрупповоеИзменение
			И КоличествоУпаковокРасхождения >= 0
			И (Параметры.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Работа
				Или Параметры.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга) Тогда
		Если ДействиеИзлишки = Перечисления.ВариантыДействийПоРасхождениямВАктеПослеОтгрузки.ВозвратПерепоставленного Тогда
			ДействиеИзлишки = Перечисления.ВариантыДействийПоРасхождениямВАктеПослеОтгрузки.ПустаяСсылка();
		КонецЕсли;
		Элементы.ВозвратПерепоставленного.Доступность = Ложь;
	КонецЕсли;
	
	Если Не ГрупповоеИзменение Тогда
		Если КоличествоУпаковокРасхождения >= 0 Тогда
			Элементы.Страницы.ТекущаяСтраница = Элементы.Излишки;
			ДействиеИзлишки = Параметры.ВыбранноеДействие;
		Иначе
			Элементы.Страницы.ТекущаяСтраница = Элементы.Недостачи;
			ДействиеНедостачи = Параметры.ВыбранноеДействие;
		КонецЕсли;
	КонецЕсли;
	
	Если ГрупповоеИзменение Тогда
		Заголовок = НСтр("ru = 'Как отработать расхождения';
						|en = 'Discrepancy treatment'");
	Иначе
		Если КоличествоУпаковокРасхождения >= 0 Тогда
			Элементы.Недостачи.Видимость = Ложь;
			Заголовок = НСтр("ru = 'Как отработать излишек';
							|en = 'Surplus treatment'");
		Иначе
			Элементы.Излишки.Видимость = Ложь;
			Заголовок = НСтр("ru = 'Как отработать недостачу';
							|en = 'Shortage treatment'");
		КонецЕсли;
	КонецЕсли;
	
	Элементы.КартинкаПояснения.Видимость = Параметры.ПоказыватьПояснение;
	Элементы.Пояснение.Видимость = Параметры.ПоказыватьПояснение;
	
	СформироватьЗаголовки(
		Параметры.ТипАкта,
		Параметры.КоличествоУпаковокРасхождения,
		Параметры.СпособОтраженияРасхождений,
		Параметры.ГрупповоеИзменение,
		Параметры.СтрокаПоЗаказу);
	
КонецПроцедуры
	
&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Не ВыполняетсяЗакрытие И Модифицированность И НЕ ЗавершениеРаботы Тогда
		
		Отказ = Истина;
		ПоказатьВопрос(Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект),
		               НСтр("ru = 'Выполненные изменения будут утеряны. Все равно закрыть?';
							|en = 'Made changes will be lost. Close anyway?'"),
		               РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	ВыполняетсяЗакрытие = Истина;
	
	Если ГрупповоеИзменение Тогда
		ПараметрыЗакрытия = Новый Структура();
		ПараметрыЗакрытия.Вставить("ДействиеИзлишки", ДействиеИзлишки);
		ПараметрыЗакрытия.Вставить("ДействиеНедостачи", ДействиеНедостачи);
		Закрыть(ПараметрыЗакрытия);
	ИначеЕсли КоличествоУпаковокРасхождения > 0 Тогда
		Закрыть(ДействиеИзлишки);
	ИначеЕсли КоличествоУпаковокРасхождения < 0 Тогда
		Закрыть(ДействиеНедостачи);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	ВыполняетсяЗакрытие = Истина;
	Закрыть(Неопределено);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СформироватьЗаголовки(ТипАкта, КоличествоУпаковокРасхождения, СпособОтраженияРасхождений, ГрупповоеИзменение, СтрокаПоЗаказу)
	
	Если ТипАкта = Перечисления.ТипыОснованияАктаОРасхождении.РеализацияТоваровУслуг Тогда
		
		// Недостачи
		Элементы.ДекорацияНедостачиСогласованы.Заголовок   = НСтр("ru = 'Недостачи при реализации согласованы с клиентом';
																	|en = 'Shortages on sales are approved with the customer'");
		Элементы.ДекорацияНедостачиНеСогласованы.Заголовок = НСтр("ru = 'Недостачи при реализации не согласованы с клиентом';
																	|en = 'Shortages on sales are not approved with the customer'");
		
		Если СпособОтраженияРасхождений = Перечисления.СпособыОтраженияРасхожденийАктПриемкиКлиента.ИсправлениеПервичныхДокументов Тогда
			Если СтрокаПоЗаказу Или (ГрупповоеИзменение И ИспользоватьЗаказыКлиентов) Тогда
				Элементы.ДопоставкаНеТребуетсяДекорация.Заголовок = НСтр("ru = 'Реализация уменьшается на недопоставленный товар с последующей отменой недопоставленных строк заказа';
																		|en = 'Sale is reduced by underdelivered goods, underdelivered order lines will be canceled'");
			Иначе
				Элементы.ДопоставкаНеТребуетсяДекорация.Заголовок = НСтр("ru = 'Реализация уменьшается на недопоставленный товар';
																		|en = 'Sales decreases for underdelivered products'");
			КонецЕсли;
			Элементы.ТребуетсяДопоставкаДекорация.Заголовок = НСтр("ru = 'Реализация уменьшается на недопоставленный товар с последующим оформлением новой реализации недопоставленного товара';
																	|en = 'Sale is reduced by underdelivered goods, new sale of underdelivered goods is registered'");
		ИначеЕсли СпособОтраженияРасхождений = Перечисления.СпособыОтраженияРасхожденийАктПриемкиКлиента.ОформлениеКорректировкиКакИсправлениеПервичныхДокументов Тогда
			Элементы.ДопоставкаНеТребуетсяДекорация.Заголовок = НСтр("ru = 'На недопоставленный товар оформляется корректировка реализации (исправление)';
																	|en = 'Sales adjustment (correction) is registered for underdelivered goods'");
			Элементы.ТребуетсяДопоставкаДекорация.Заголовок = НСтр("ru = 'На недопоставленный товар оформляется корректировка реализации (исправление) с последующим оформлением реализации недопоставленного товара';
																	|en = 'Sales adjustment (correction) is registered for underdelivered goods and a new underdelivered goods sale is registered'");
		ИначеЕсли СпособОтраженияРасхождений = Перечисления.СпособыОтраженияРасхожденийАктПриемкиКлиента.ОформлениеКорректировкиПоСогласованию Тогда
			Элементы.ДопоставкаНеТребуетсяДекорация.Заголовок = НСтр("ru = 'На недопоставленный товар оформляется корректировка реализации (по согласованию сторон)';
																	|en = 'Sales adjustment is registered for underdelivered goods (as agreed by the parties)'");
			Элементы.ТребуетсяДопоставкаДекорация.Заголовок = НСтр("ru = 'На недопоставленный товар оформляется корректировка реализации (по согласованию сторон) с последующим оформлением реализации недопоставленного товара';
																	|en = 'Sales adjustment is registered for underdelivered goods (as agreed by the parties) and a new underdelivered goods sale is registered'");
		ИначеЕсли СпособОтраженияРасхождений = Перечисления.СпособыОтраженияРасхожденийАктПриемкиКлиента.ОформлениеКорректировокКакНовыеПервичныеДокументы Тогда
			Элементы.ДопоставкаНеТребуетсяДекорация.Заголовок = НСтр("ru = 'На недопоставленный товар оформляется корректировка реализации (возврат недопоставленного товара)';
																	|en = 'Sales adjustment (return of underdelivered goods) is registered for underdelivered goods'");
			Элементы.ТребуетсяДопоставкаДекорация.Заголовок = НСтр("ru = 'На недопоставленный товар оформляется корректировка реализации (возврат недопоставленного товара) с последующим оформлением реализации на допоставку';
																	|en = 'Sales adjustment (return of underdelivered goods) is registered for underdelivered goods and subsequent delivery sale is registered'");
		КонецЕсли;
		
		Элементы.НедостачаНеПризнанаДекорация.Заголовок = НСтр("ru = 'Недопоставленный товар не отгружается со склада, документы не переоформляются';
																|en = 'The underdelivered goods are not shipped from the warehouse; the documents are not reregistered.'");
		Элементы.ОтгрузитьСейчасДекорация.Заголовок = НСтр("ru = 'Недопоставленный товар отгружается со склада, документы не переоформляются';
															|en = 'The underdelivered goods are shipped from the warehouse; the documents are not reregistered.'");
		
		// Излишки
		
		Элементы.ДекорацияИзлишкиСогласованы.Заголовок   = НСтр("ru = 'Излишки при реализации согласованы с клиентом';
																|en = 'Customer confirms the inventory surplus'");
		Элементы.ДекорацияИзлишкиНеСогласованы.Заголовок = НСтр("ru = 'Излишки при реализации не согласованы с клиентом';
																|en = 'Customer doesn''t confirm the inventory surplus'");
		
		Если СпособОтраженияРасхождений = Перечисления.СпособыОтраженияРасхожденийАктПриемкиКлиента.ИсправлениеПервичныхДокументов Тогда
			Элементы.ПокупкаПерепоставленногоДекорация.Заголовок = НСтр("ru = 'Реализация увеличивается на перепоставленный товар';
																		|en = 'Sales increases for overdelivered products'");
			Если ИспользоватьЗаявкиНаВозврат Тогда
				Элементы.ВозвратПерепоставленногоДекорация.Заголовок = НСтр("ru = 'Реализация увеличивается на перепоставленный товар с последующим оформлением заявки на возврат перепоставленного товара';
																			|en = 'Sale is increases by the amount of overdelivered goods. A request for return of overdelivered goods will be registered'");
			Иначе
				Элементы.ВозвратПерепоставленногоДекорация.Заголовок = НСтр("ru = 'Реализация увеличивается на перепоставленный товар с последующим оформлением возврата перепоставленного товара';
																			|en = 'Sale is increases by overdelivered goods, return of overdelivered goods will be registered'");
			КонецЕсли;
		ИначеЕсли СпособОтраженияРасхождений = Перечисления.СпособыОтраженияРасхожденийАктПриемкиКлиента.ОформлениеКорректировкиКакИсправлениеПервичныхДокументов Тогда
			Элементы.ПокупкаПерепоставленногоДекорация.Заголовок = НСтр("ru = 'На перепоставленный товар оформляется корректировка реализации (исправление)';
																		|en = 'Sales adjustment (correction) is registered for overdelivered goods'");
			Если ИспользоватьЗаявкиНаВозврат Тогда
				Элементы.ВозвратПерепоставленногоДекорация.Заголовок = НСтр("ru = 'На перепоставленный товар оформляется корректировка реализации (исправление) с последующим оформлением заявки на возврат перепоставленного товара';
																			|en = 'Sales adjustment (correction) is registered for overdelivered goods. A return request of overdelivered goods will be registered'");
			Иначе
				Элементы.ВозвратПерепоставленногоДекорация.Заголовок = НСтр("ru = 'На перепоставленный товар оформляется корректировка реализации (исправление) с последующим оформлением возврата перепоставленного товара';
																			|en = 'Sales adjustment (correction) is registered for overdelivered goods. A return of overdelivered goods will be registered'");
			КонецЕсли;
		ИначеЕсли СпособОтраженияРасхождений = Перечисления.СпособыОтраженияРасхожденийАктПриемкиКлиента.ОформлениеКорректировкиПоСогласованию Тогда
			Элементы.ПокупкаПерепоставленногоДекорация.Заголовок = НСтр("ru = 'На перепоставленный товар оформляется корректировка реализации (по согласованию сторон)';
																		|en = 'Sales adjustment is registered for overdelivered goods (as agreed by the parties)'");
			Если ИспользоватьЗаявкиНаВозврат Тогда
				Элементы.ВозвратПерепоставленногоДекорация.Заголовок = НСтр("ru = 'На перепоставленный товар оформляется корректировка реализации (по согласованию сторон) с последующим оформлением заявки на возврат перепоставленного товара';
																			|en = 'Sales adjustment is registered for overdelivered goods (as agreed by the parties), overdelivered goods return request will be registered'");
			Иначе
				Элементы.ВозвратПерепоставленногоДекорация.Заголовок = НСтр("ru = 'На перепоставленный товар оформляется корректировка реализации (по согласованию сторон) с последующим оформлением возврата перепоставленного товара';
																			|en = 'Sales adjustment is registered for overdelivered goods (as agreed by the parties), overdelivered goods return will be registered'");
			КонецЕсли;
		ИначеЕсли СпособОтраженияРасхождений = Перечисления.СпособыОтраженияРасхожденийАктПриемкиКлиента.ОформлениеКорректировокКакНовыеПервичныеДокументы Тогда
			Элементы.ПокупкаПерепоставленногоДекорация.Заголовок = НСтр("ru = 'На перепоставленный товар оформляется корректировка реализации (реализация перепоставленного)';
																		|en = 'Sales adjustment (overdelivered goods sale) is registered for overdelivered goods'");
			Если ИспользоватьЗаявкиНаВозврат Тогда
				Элементы.ВозвратПерепоставленногоДекорация.Заголовок = НСтр("ru = 'На перепоставленный товар оформляется корректировка реализации (реализация перепоставленного товара) с последующим оформлением заявки на возврат перепоставленного товара';
																			|en = 'Sales adjustment (overdelivered goods sale) is registered for overdelivered goods. A request for return of overdelivered goods will be registered'");
			Иначе
				Элементы.ВозвратПерепоставленногоДекорация.Заголовок = НСтр("ru = 'На перепоставленный товар оформляется корректировка реализации (реализация перепоставленного товара) с последующим оформлением возврата перепоставленного товара';
																			|en = 'Sales adjustment (overdelivered goods sale) is registered for overdelivered goods, return of overdelivered goods will be registered'");
			КонецЕсли;
		КонецЕсли;
		
		Элементы.ПерепоставленноеДаритсяДекорация.Заголовок = НСтр("ru = 'Перепоставленный товар не возвращается на склад, документы не переоформляются';
																	|en = 'Overdelivered goods are not returned to the warehouse. The documents are not registered'");
		Элементы.ОприходоватьСейчасДекорация.Заголовок = НСтр("ru = 'Перепоставленный товар возвращается на склад, документы не переоформляются';
																|en = 'Overdelivered goods are returned to the warehouse. The documents are not registered'");
		
	ИначеЕсли ТипАкта = Перечисления.ТипыОснованияАктаОРасхождении.ВозвратПоставщику Тогда
		
		// Недостачи
		Элементы.ДекорацияНедостачиСогласованы.Заголовок   = НСтр("ru = 'Недостачи при возврате согласованы с поставщиком';
																	|en = 'Shortages on return are approved by the vendor'");
		Элементы.ДекорацияНедостачиНеСогласованы.Заголовок = НСтр("ru = 'Недостачи при возврате не согласованы с поставщиком';
																	|en = 'Shortages on return are not approved by the vendor'");
		
		Элементы.ДопоставкаНеТребуетсяДекорация.Заголовок = НСтр("ru = 'Возврат товаров поставщику уменьшается на недопоставленный товар';
																|en = 'Return of goods to vendor is reduced by the amount of underdelivered goods'");
		Элементы.ТребуетсяДопоставкаДекорация.Заголовок = НСтр("ru = 'Возврат товаров поставщику уменьшается на недопоставленный товар с последующим оформлением нового возврата недопоставленного товара';
																|en = 'Return of goods to vendor is reduced by the amount of underdelivered goods, a new return of underdelivered goods is registered'");
		Элементы.НедостачаНеПризнанаДекорация.Заголовок = НСтр("ru = 'Недопоставленный товар не отгружается со склада, документы не переоформляются';
																|en = 'The underdelivered goods are not shipped from the warehouse; the documents are not reregistered.'");
		Элементы.ОтгрузитьСейчасДекорация.Заголовок = НСтр("ru = 'Недопоставленный товар отгружается со склада, документы не переоформляются';
															|en = 'The underdelivered goods are shipped from the warehouse; the documents are not reregistered.'");
		
		// Излишки
		Элементы.ДекорацияИзлишкиСогласованы.Заголовок   = НСтр("ru = 'Излишки при возврате согласованы с поставщиком';
																|en = 'Surpluses on return are approved by the vendor'");
		Элементы.ДекорацияИзлишкиНеСогласованы.Заголовок = НСтр("ru = 'Излишки при возврате не согласованы с поставщиком';
																|en = 'Surpluses on return are not approved by the vendor'");
		
		Элементы.ПокупкаПерепоставленногоДекорация.Заголовок = НСтр("ru = 'Возврат товаров поставщику увеличивается на перепоставленный товар';
																	|en = 'Return of goods to vendor is increased by the amount of overdelivered goods'");
		Элементы.ВозвратПерепоставленногоДекорация.Заголовок = НСтр("ru = 'Возврат товаров поставщику увеличивается на перепоставленный товар с последующим оформлением поступления перепоставленного товара';
																	|en = 'Goods return to vendor is increased by the overdelivered goods, a receipt of overdelivered goods will be registered '");
		Элементы.ПерепоставленноеДаритсяДекорация.Заголовок = НСтр("ru = 'Перепоставленный товар не возвращается на склад, документы не переоформляются';
																	|en = 'Overdelivered goods are not returned to the warehouse. The documents are not registered'");
		Элементы.ОприходоватьСейчасДекорация.Заголовок = НСтр("ru = 'Перепоставленный товар возвращается на склад, документы не переоформляются';
																|en = 'Overdelivered goods are returned to the warehouse. The documents are not registered'");
		
	ИначеЕсли ТипАкта = "Перемещение" Тогда
		
		// Недостачи
		Элементы.ДекорацияНедостачиСогласованы.Заголовок   = НСтр("ru = 'Недостачи при поступлении согласованы с отправителем';
																	|en = 'Shortages on receipt are approved with the sender'");
		Элементы.ДекорацияНедостачиНеСогласованы.Заголовок = НСтр("ru = 'Недостачи при поступлении не согласованы с отправителем';
																	|en = 'Shortages on receipt are not approved with the sender'");
		
		Если СтрокаПоЗаказу Или (ГрупповоеИзменение И ИспользоватьЗаказыНаПеремещение) Тогда
			Элементы.ДопоставкаНеТребуетсяДекорация.Заголовок = НСтр("ru = 'Перемещение товаров уменьшается на недопоставленный товар с последующей отменой недопоставленных строк заказа';
																	|en = 'Goods transfer is reduced by underdelivered goods, underdelivered lines of the order will be canceled'");
		Иначе
			Элементы.ДопоставкаНеТребуетсяДекорация.Заголовок = НСтр("ru = 'Перемещение товаров уменьшается на недопоставленный товар';
																	|en = 'Goods transfer reduces for underdelivered goods'");
		КонецЕсли;
		Элементы.ТребуетсяДопоставкаДекорация.Заголовок = НСтр("ru = 'Перемещение товаров уменьшается на недопоставленный товар с последующим оформлением нового перемещения недопоставленного товара';
																|en = 'Goods transfer will be reduced by underdelivered goods and new underdelivered goods transfer will be registered'");
		Элементы.НедостачаНеПризнанаДекорация.Заголовок = НСтр("ru = 'Недопоставленный товар не отгружается со склада-отправителя, документы не переоформляются';
																|en = 'The underdelivered goods are not shipped from the origin warehouse; the documents are not reregistered'");
		Элементы.ОтгрузитьСейчасДекорация.Заголовок = НСтр("ru = 'Недопоставленный товар отгружается со склада-отправителя, документы не переоформляются';
															|en = 'The underdelivered goods are shipped from the origin warehouse; the documents are not reregistered'");
		
		// Излишки
		Элементы.ДекорацияИзлишкиСогласованы.Заголовок   = НСтр("ru = 'Излишки при поступлении согласованы с отправителем';
																|en = 'Surpluses on receipt are approved with the sender'");
		Элементы.ДекорацияИзлишкиНеСогласованы.Заголовок = НСтр("ru = 'Излишки при поступлении не согласованы с отправителем';
																|en = 'Surpluses on receipt are not approved with the sender'");
		
		Элементы.ПокупкаПерепоставленногоДекорация.Заголовок = НСтр("ru = 'Перемещение товаров увеличивается на перепоставленный товар';
																	|en = 'Goods transfer increases for overdelivered goods'");
		Элементы.ВозвратПерепоставленногоДекорация.Заголовок = НСтр("ru = 'Перемещение товаров увеличивается на перепоставленный товар с последующим оформлением обратного перемещения перепоставленного товара';
																	|en = 'Goods transfer is increased by overdelivered goods, reverse overdelivered goods transfer will be registered'");
		Элементы.ПерепоставленноеДаритсяДекорация.Заголовок = НСтр("ru = 'Перепоставленный товар не возвращается на склад-отправитель, документы не переоформляются';
																	|en = 'Overdelivered goods are not returned to the origin warehouse. The documents are not registered'");
		Элементы.ОприходоватьСейчасДекорация.Заголовок = НСтр("ru = 'Перепоставленный товар возвращается на склад-отправитель, документы не переоформляются';
																|en = 'Overdelivered goods are returned to the origin warehouse. The documents are not registered'");
		
	ИначеЕсли РасхожденияКлиентСервер.ТипОснованияПередачаТоваровХранителю(ТипАкта)
		Или РасхожденияКлиентСервер.ТипОснованияПередачаНаКомиссию(ТипАкта) Тогда
		
		// Недостачи
		Элементы.ДекорацияНедостачиСогласованы.Заголовок   = НСтр("ru = 'Недостачи при передаче согласованы с партнером';
																	|en = 'Shortages on transfer are agreed with the partner'");
		Элементы.ДекорацияНедостачиНеСогласованы.Заголовок = НСтр("ru = 'Недостачи при передаче не согласованы с партнером';
																	|en = 'Shortages on transfer are not agreed with the partner'");
		
		Если СпособОтраженияРасхождений = Перечисления.СпособыОтраженияРасхожденийАктПриемкиКлиента.ОформлениеКорректировкиКакИсправлениеПервичныхДокументов Тогда
			
			Если СтрокаПоЗаказу
				Или (ГрупповоеИзменение
					И ИспользоватьЗаказыКлиентов) Тогда
				
				Если ТипАкта = Перечисления.ТипыОснованияАктаОРасхождении.ПередачаНаКомиссию Тогда
					ТекстЗаголовка
						= НСтр("ru = 'На недопоставленный товар оформляется передача на комиссию (исправление) с последующей отменой недопоставленных строк заказа';
								|en = 'For underdelivered goods, consignment sale (correction) is registered, followed by cancellation of the underdelivered order lines'");
				//++ НЕ УТ
				ИначеЕсли ТипАкта = Перечисления.ТипыОснованияАктаОРасхождении.ПередачаТоваровПереработчику Тогда
					ТекстЗаголовка
						= НСтр("ru = 'На недопоставленное сырье оформляется передача переработчику (исправление) с последующей отменой недопоставленных строк заказа';
								|en = 'For underdelivered raw materials, a transfer to the subcontractor (correction) is registered, followed by cancellation of the underdelivered order lines.'");
				//-- НЕ УТ
				Иначе // Перечисления.ТипыОснованияАктаОРасхождении.ПередачаТоваровХранителю
					ТекстЗаголовка
						= НСтр("ru = 'На недопоставленный товар оформляется передача хранителю (исправление) с последующей отменой недопоставленных строк заказа';
								|en = 'For underdelivered goods, a VMI fill-up (correction) is registered, followed by cancellation of the underdelivered order lines'");
				КонецЕсли;
				Элементы.ДопоставкаНеТребуетсяДекорация.Заголовок = ТекстЗаголовка;
				
			Иначе
				
				Если ТипАкта = Перечисления.ТипыОснованияАктаОРасхождении.ПередачаНаКомиссию Тогда
					ТекстЗаголовка
						= НСтр("ru = 'На недопоставленный товар оформляется передача на комиссию (исправление)';
								|en = 'For underdelivered goods, consignment sale (correction) is registered'");
				//++ НЕ УТ
				ИначеЕсли ТипАкта = Перечисления.ТипыОснованияАктаОРасхождении.ПередачаТоваровПереработчику Тогда
					ТекстЗаголовка
						= НСтр("ru = 'На недопоставленное сырье оформляется передача переработчику (исправление)';
								|en = 'For underdelivered raw materials, a transfer to the subcontractor (correction) is registered'");
				//-- НЕ УТ
				Иначе // Перечисления.ТипыОснованияАктаОРасхождении.ПередачаТоваровХранителю
					ТекстЗаголовка
						= НСтр("ru = 'На недопоставленный товар оформляется передача хранителю (исправление)';
								|en = 'For underdelivered goods, a VMI fill-up (correction) is registered'");
				КонецЕсли;
				Элементы.ДопоставкаНеТребуетсяДекорация.Заголовок = ТекстЗаголовка;
				
			КонецЕсли;
			
			Если ТипАкта = Перечисления.ТипыОснованияАктаОРасхождении.ПередачаНаКомиссию Тогда
				ТекстЗаголовка
					= НСтр("ru = 'На недопоставленный товар оформляется передача на комиссию (исправление) с последующим оформлением новой передачи недопоставленного товара';
							|en = 'For underdelivered goods, consignment sale (correction) is registered, and a new underdelivered goods transfer is registered'");
			//++ НЕ УТ
			ИначеЕсли ТипАкта = Перечисления.ТипыОснованияАктаОРасхождении.ПередачаТоваровПереработчику Тогда
				ТекстЗаголовка
					= НСтр("ru = 'На недопоставленное сырье оформляется передача переработчику (исправление) с последующим оформлением новой передачи недопоставленного товара';
							|en = 'For underdelivered raw materials, a transfer to the subcontractor (correction) is registered, and a new underdelivered goods transfer is registered'");
			//-- НЕ УТ
			Иначе // Перечисления.ТипыОснованияАктаОРасхождении.ПередачаТоваровХранителю
				ТекстЗаголовка
					= НСтр("ru = 'На недопоставленный товар оформляется передача хранителю (исправление) с последующим оформлением новой передачи недопоставленного товара';
							|en = 'For underdelivered goods, a VMI fill-up (correction) is registered, and a new underdelivered goods transfer is registered'");
			КонецЕсли;
			Элементы.ТребуетсяДопоставкаДекорация.Заголовок = ТекстЗаголовка;
			
		Иначе
			
			Если СтрокаПоЗаказу
				Или (ГрупповоеИзменение
					И ИспользоватьЗаказыКлиентов) Тогда
				
				Элементы.ДопоставкаНеТребуетсяДекорация.Заголовок
					= НСтр("ru = 'Передача уменьшается на недопоставленный товар с последующей отменой недопоставленных строк заказа';
							|en = 'Transfer is reduced by short-delivered goods, and short-delivered order lines are canceled'");
				
			Иначе
				Элементы.ДопоставкаНеТребуетсяДекорация.Заголовок
					= НСтр("ru = 'Передача уменьшается на недопоставленный товар';
							|en = 'Transfer is reduced by short-delivered goods'");
			КонецЕсли;
			
			Элементы.ТребуетсяДопоставкаДекорация.Заголовок
				= НСтр("ru = 'Передача уменьшается на недопоставленный товар с последующим оформлением новой передачи недопоставленного товара';
						|en = 'Transfer is reduced by short-delivered goods, and a new transfer of short-delivered goods is registered'");
			
		КонецЕсли;
		
		Элементы.НедостачаНеПризнанаДекорация.Заголовок
			= НСтр("ru = 'Недопоставленный товар не отгружается со склада, документы не переоформляются';
					|en = 'The underdelivered goods are not shipped from the warehouse; the documents are not reregistered.'");
		Элементы.ОтгрузитьСейчасДекорация.Заголовок
			= НСтр("ru = 'Недопоставленный товар отгружается со склада, документы не переоформляются';
					|en = 'The underdelivered goods are shipped from the warehouse; the documents are not reregistered.'");
		
		// Излишки
		Элементы.ДекорацияИзлишкиСогласованы.Заголовок   = НСтр("ru = 'Излишки при передаче согласованы с партнером';
																|en = 'Surpluses on transfer are agreed with the partner'");
		Элементы.ДекорацияИзлишкиНеСогласованы.Заголовок = НСтр("ru = 'Излишки при передаче не согласованы с партнером';
																|en = 'Surpluses on transfer are not agreed with the partner'");
		
		Если СпособОтраженияРасхождений = Перечисления.СпособыОтраженияРасхожденийАктПриемкиКлиента.ОформлениеКорректировкиКакИсправлениеПервичныхДокументов Тогда
			
			Элементы.ПокупкаПерепоставленногоДекорация.Заголовок
				= НСтр("ru = 'На перепоставленный товар оформляется передача хранителю (исправление)';
						|en = 'For overdelivered goods, a VMI fill-up (correction) is registered'");
			
			Если ИспользоватьЗаявкиНаВозврат
			   //++ НЕ УТ
			   И Параметры.ТипОснованияАктаОРасхождении <> Перечисления.ТипыОснованияАктаОРасхождении.ПередачаТоваровПереработчику
			   //-- НЕ УТ
			   Тогда
				Если ТипАкта = Перечисления.ТипыОснованияАктаОРасхождении.ПередачаНаКомиссию Тогда
					ТекстЗаголовка
						= НСтр("ru = 'На перепоставленный товар оформляется передача на комиссию (исправление) с последующим оформлением заявки на возврат перепоставленного товара';
								|en = 'For overdelivered goods, a consignment sale (correction) is registered, and a new overdelivered goods return request is registered'");
				//++ НЕ УТ
				ИначеЕсли ТипАкта = Перечисления.ТипыОснованияАктаОРасхождении.ПередачаТоваровПереработчику Тогда
					ТекстЗаголовка
						= НСтр("ru = 'На перепоставленное сырье оформляется передача переработчику (исправление) с последующим оформлением заявки на возврат перепоставленного сырья';
								|en = 'For overdelivered raw materials, a transfer to the subcontractor (correction) is registered, and a new overdelivered raw materials return request is registered'");
				//-- НЕ УТ
				Иначе // Перечисления.ТипыОснованияАктаОРасхождении.ПередачаТоваровХранителю
					ТекстЗаголовка
						= НСтр("ru = 'На перепоставленный товар оформляется передача хранителю (исправление) с последующим оформлением заявки на возврат перепоставленного товара';
								|en = 'For overdelivered goods, a VMI fill-up (correction) is registered, and a new overdelivered goods return request is registered'");
				КонецЕсли;
				Элементы.ВозвратПерепоставленногоДекорация.Заголовок = ТекстЗаголовка;
			Иначе
				Если ТипАкта = Перечисления.ТипыОснованияАктаОРасхождении.ПередачаНаКомиссию Тогда
					ТекстЗаголовка
						= НСтр("ru = 'На перепоставленный товар оформляется передача на комиссию (исправление) с последующим оформлением поступления перепоставленного товара';
								|en = 'For overdelivered goods, a transfer to consignment (correction) is registered, and a new overdelivered goods receipt is registered'");
				//++ НЕ УТ
				ИначеЕсли ТипАкта = Перечисления.ТипыОснованияАктаОРасхождении.ПередачаТоваровПереработчику Тогда
					ТекстЗаголовка
						= НСтр("ru = 'На перепоставленное сырье оформляется передача переработчику (исправление) с последующим оформлением поступления перепоставленного сырья';
								|en = 'For overdelivered raw materials, a transfer to the subcontractor (correction) is registered, and a new overdelivered goods receipt is registered'");
				//-- НЕ УТ
				Иначе // Перечисления.ТипыОснованияАктаОРасхождении.ПередачаТоваровХранителю
					ТекстЗаголовка
						= НСтр("ru = 'На перепоставленный товар оформляется передача хранителю (исправление) с последующим оформлением поступления перепоставленного товара';
								|en = 'For overdelivered goods, a VMI fill-up (correction) is registered and a new overdelivered goods receipt is registered'");
				КонецЕсли;
				Элементы.ВозвратПерепоставленногоДекорация.Заголовок
					= НСтр("ru = 'На перепоставленный товар оформляется передача хранителю (исправление) с последующим оформлением поступления перепоставленного товара';
							|en = 'For overdelivered goods, a VMI fill-up (correction) is registered and a new overdelivered goods receipt is registered'");
			КонецЕсли;
			
		Иначе
			
			Элементы.ПокупкаПерепоставленногоДекорация.Заголовок = НСтр("ru = 'Передача увеличивается на перепоставленный товар';
																		|en = 'Transfer increases for overdelivered goods'");
			
			Если ИспользоватьЗаявкиНаВозврат
			   //++ НЕ УТ
			   И Параметры.ТипОснованияАктаОРасхождении <> Перечисления.ТипыОснованияАктаОРасхождении.ПередачаТоваровПереработчику
			   //-- НЕ УТ
			   Тогда
				Элементы.ВозвратПерепоставленногоДекорация.Заголовок
					= НСтр("ru = 'Передача увеличивается на перепоставленный товар с последующим оформлением заявки на возврат перепоставленного товара';
							|en = 'Transfer is increased by the amount of overdelivered goods. A request for return of overdelivered goods will be registered'");
			Иначе
				Элементы.ВозвратПерепоставленногоДекорация.Заголовок
					= НСтр("ru = 'Передача увеличивается на перепоставленный товар с последующим оформлением поступления перепоставленного товара';
							|en = 'Transfer is increased by overdelivered goods, a receipt for overdelivered goods will be registered'");
			КонецЕсли;
			
		КонецЕсли;
		
		Элементы.ПерепоставленноеДаритсяДекорация.Заголовок
			= НСтр("ru = 'Перепоставленный товар не возвращается на склад, документы не переоформляются';
					|en = 'Overdelivered goods are not returned to the warehouse. The documents are not registered'");
		Элементы.ОприходоватьСейчасДекорация.Заголовок
			= НСтр("ru = 'Перепоставленный товар возвращается на склад, документы не переоформляются';
					|en = 'Overdelivered goods are returned to the warehouse. The documents are not registered'");
		
	ИначеЕсли ТипАкта = Перечисления.ТипыОснованияАктаОРасхождении.ОтгрузкаТоваровСХранения Тогда
		
		// Недостачи
		Элементы.ДекорацияНедостачиСогласованы.Заголовок   = НСтр("ru = 'Недостачи при отгрузке с ответственного хранения согласованы с поставщиком';
																	|en = 'Shortages when VMI pick-up request is approved by the vendor.'");
		Элементы.ДекорацияНедостачиНеСогласованы.Заголовок = НСтр("ru = 'Недостачи при отгрузке с ответственного хранения не согласованы с поставщиком';
																	|en = 'Shortages when VMI pick-up request is not approved by the vendor.'");
		
		Если СпособОтраженияРасхождений = Перечисления.СпособыОтраженияРасхожденийАктПриемкиКлиента.ОформлениеКорректировкиКакИсправлениеПервичныхДокументов Тогда
			Если Параметры.ОтгрузкаПринципалу Тогда
				ТекстЗаголовка
					= НСтр("ru = 'На недопоставленный товар оформляется отгрузка принципалу (исправление)';
							|en = 'For underdelivered goods, shipment to the principal (correction) is registered'");
			Иначе
				ТекстЗаголовка
					= НСтр("ru = 'На недопоставленный товар оформляется отгрузка поклажедателю (исправление)';
							|en = 'For underdelivered goods, shipment to the depositor (correction) is registered'");
			КонецЕсли;
			Элементы.ДопоставкаНеТребуетсяДекорация.Заголовок = ТекстЗаголовка;
			Если Параметры.ОтгрузкаПринципалу Тогда
				ТекстЗаголовка
					= НСтр("ru = 'На недопоставленный товар оформляется отгрузка принципалу (исправление) с последующим оформлением новой отгрузки недопоставленного товара';
							|en = 'For underdelivered goods, shipment to the principal (correction) is registered, and a new underdelivered goods shipment is registered'");
			Иначе
				ТекстЗаголовка
					= НСтр("ru = 'На недопоставленный товар оформляется отгрузка поклажедателю (исправление) с последующим оформлением новой отгрузки недопоставленного товара';
							|en = 'For underdelivered goods, shipment to the depositor (correction) is registered, and a new underdelivered goods shipment is registered'");
			КонецЕсли;
			Элементы.ТребуетсяДопоставкаДекорация.Заголовок = ТекстЗаголовка;
		Иначе
			Элементы.ДопоставкаНеТребуетсяДекорация.Заголовок
				= НСтр("ru = 'Отгрузка товаров поклажедателю уменьшается на недопоставленный товар';
						|en = 'Shipment of goods to the depositor is reduced by underdelivered goods'");
			Элементы.ТребуетсяДопоставкаДекорация.Заголовок
				= НСтр("ru = 'Отгрузка товаров поклажедателю уменьшается на недопоставленный товар с последующим оформлением новой отгрузки недопоставленного товара';
						|en = 'Shipment of goods to the depositor is reduced by the underdelivered goods with subsequent registration of a new shipment of underdelivered goods'");
		КонецЕсли;
		
		Элементы.НедостачаНеПризнанаДекорация.Заголовок = НСтр("ru = 'Недопоставленный товар не отгружается со склада, документы не переоформляются';
																|en = 'The underdelivered goods are not shipped from the warehouse; the documents are not reregistered.'");
		Элементы.ОтгрузитьСейчасДекорация.Заголовок = НСтр("ru = 'Недопоставленный товар отгружается со склада, документы не переоформляются';
															|en = 'The underdelivered goods are shipped from the warehouse; the documents are not reregistered.'");
		
		// Излишки
		Элементы.ДекорацияИзлишкиСогласованы.Заголовок   = НСтр("ru = 'Излишки при отгрузке с ответственного хранения согласованы с поставщиком';
																|en = 'Surpluses when VMI pick-up request is approved by the vendor'");
		Элементы.ДекорацияИзлишкиНеСогласованы.Заголовок = НСтр("ru = 'Излишки при отгрузке с ответственного хранения не согласованы с поставщиком';
																|en = 'Surpluses when VMI pick-up request is not approved by the vendor'");
		
		Если СпособОтраженияРасхождений = Перечисления.СпособыОтраженияРасхожденийАктПриемкиКлиента.ОформлениеКорректировкиКакИсправлениеПервичныхДокументов Тогда
			Если Параметры.ОтгрузкаПринципалу Тогда
				ТекстЗаголовка
					= НСтр("ru = 'На перепоставленный товар оформляется отгрузка принципалу (исправление)';
							|en = 'For overdelivered goods, shipment to the principal is registered (correction)'");
			Иначе
				ТекстЗаголовка
					= НСтр("ru = 'На перепоставленный товар оформляется отгрузка поклажедателю (исправление)';
							|en = 'For overdelivered goods, shipment to the depositor  (correction) is registered'");
			КонецЕсли;
			Элементы.ПокупкаПерепоставленногоДекорация.Заголовок = ТекстЗаголовка;
			Если Параметры.ОтгрузкаПринципалу Тогда
				ТекстЗаголовка
					= НСтр("ru = 'На перепоставленный товар оформляется отгрузка принципалу (исправление) с последующим оформлением поступления перепоставленного товара';
							|en = 'For overdelivered goods, shipment to the principal (correction) is registered, and a new overdelivered goods receipt is registered'");
			Иначе
				ТекстЗаголовка
					= НСтр("ru = 'На перепоставленный товар оформляется отгрузка поклажедателю (исправление) с последующим оформлением поступления перепоставленного товара';
							|en = 'For overdelivered goods, shipment to the depositor (correction) is registered, and a new overdelivered goods receipt is registered'");
			КонецЕсли;
			Элементы.ВозвратПерепоставленногоДекорация.Заголовок = ТекстЗаголовка;
		Иначе
			Элементы.ПокупкаПерепоставленногоДекорация.Заголовок
				= НСтр("ru = 'Отгрузка товаров поклажедателю увеличивается на перепоставленный товар';
						|en = 'Shipment of goods to the depositor is increased by the overdelivered goods'");
			Элементы.ВозвратПерепоставленногоДекорация.Заголовок
				= НСтр("ru = 'Отгрузка товаров поклажедателю увеличивается на перепоставленный товар с последующим оформлением поступления перепоставленного товара';
						|en = 'Goods shipment to depositor is increased by the overdelivered goods, a receipt of overdelivered goods will be registered'");
		КонецЕсли;
		
		Элементы.ПерепоставленноеДаритсяДекорация.Заголовок = НСтр("ru = 'Перепоставленный товар не возвращается на склад, документы не переоформляются';
																	|en = 'Overdelivered goods are not returned to the warehouse. The documents are not registered'");
		Элементы.ОприходоватьСейчасДекорация.Заголовок = НСтр("ru = 'Перепоставленный товар возвращается на склад, документы не переоформляются';
																|en = 'Overdelivered goods are returned to the warehouse. The documents are not registered'");
		
	//++ НЕ УТКА
	ИначеЕсли ТипАкта = Перечисления.ТипыОснованияАктаОРасхождении.ПередачаДавальцу Тогда
		
		// Недостачи
		Элементы.ДекорацияНедостачиСогласованы.Заголовок     = НСтр("ru = 'Недостачи при передаче продукции согласованы с давальцем';
																	|en = 'Shortage at transfer of manufactured products is approved with the provider'");
		Элементы.ДекорацияНедостачиНеСогласованы.Заголовок   = НСтр("ru = 'Недостачи при передаче продукции не согласованы с давальцем';
																	|en = 'Shortage at transfer of manufactured products is not approved with the provider'");
		
		Если СпособОтраженияРасхождений = Перечисления.СпособыОтраженияРасхожденийАктПриемкиКлиента.ОформлениеКорректировкиКакИсправлениеПервичныхДокументов Тогда
			Элементы.ДопоставкаНеТребуетсяДекорация.Заголовок
				= НСтр("ru = 'На недопоставленную продукцию оформляется передача давальцу (исправление)';
						|en = 'For underdelivered goods, transfer to the provider (correction) is registered'");
			Элементы.ТребуетсяДопоставкаДекорация.Заголовок
				= НСтр("ru = 'На недопоставленную продукцию оформляется передача давальцу (исправление) с последующим оформлением новой передачи недопоставленной продукции';
						|en = 'For underdelivered goods, transfer to the provider (correction) is registered, and a new transfer of underdelivered goods is registered'");
		Иначе
			Элементы.ДопоставкаНеТребуетсяДекорация.Заголовок
				= НСтр("ru = 'Передача продукции давальцу уменьшается на недопоставленную продукцию';
						|en = 'Transfer of manufactured products to the provider is reduced by the quantity of undelivered goods'");
			Элементы.ТребуетсяДопоставкаДекорация.Заголовок
				= НСтр("ru = 'Передача продукции давальцу уменьшается на недопоставленную продукцию с последующим оформлением новой передачи недопоставленной продукции';
						|en = 'Transfer of manufactured products to the provider is reduced by the quantity of undelivered goods with the subsequent registration of a new transfer of undelivered goods'");
		КонецЕсли;
		
		Элементы.НедостачаНеПризнанаДекорация.Заголовок      = НСтр("ru = 'Недопоставленная продукция не отгружается со склада, документы не переоформляются';
																	|en = 'Undelivered goods are not shipped from the warehouse. The documents are not reregistered'");
		Элементы.ОтгрузитьСейчасДекорация.Заголовок          = НСтр("ru = 'Недопоставленная продукция отгружается со склада, документы не переоформляются';
																	|en = 'Undelivered goods are shipped from the warehouse. The documents are not reregistered'");
		
		// Излишки
		Элементы.ДекорацияИзлишкиСогласованы.Заголовок       = НСтр("ru = 'Излишки при передаче продукции согласованы с давальцем';
																	|en = 'Surplus at transfer of manufactured products is approved with the provider'");
		Элементы.ДекорацияИзлишкиНеСогласованы.Заголовок     = НСтр("ru = 'Излишки при передаче продукции не согласованы с давальцем';
																	|en = 'Surplus at transfer of manufactured products is not approved with the provider'");
		
		Если СпособОтраженияРасхождений = Перечисления.СпособыОтраженияРасхожденийАктПриемкиКлиента.ОформлениеКорректировкиКакИсправлениеПервичныхДокументов Тогда
			Элементы.ПокупкаПерепоставленногоДекорация.Заголовок
				= НСтр("ru = 'На перепоставленную продукцию оформляется передача давальцу (исправление)';
						|en = 'For overdelivered goods, transfer to the provider (correction) is registered'");
			Элементы.ВозвратПерепоставленногоДекорация.Заголовок
				= НСтр("ru = 'На перепоставленную продукцию оформляется передача давальцу (исправление) с последующим оформлением поступления перепоставленной продукции';
						|en = 'For overdelivered goods, transfer to provider (correction) is registered, and a new receipt of overdelivered goods is registered'");
		Иначе
			Элементы.ПокупкаПерепоставленногоДекорация.Заголовок
				= НСтр("ru = 'Передача продукции давальцу увеличивается на перепоставленную продукцию';
						|en = 'Transfer of manufactured products to the provider increases by the quantity of overdelivered goods'");
			Элементы.ВозвратПерепоставленногоДекорация.Заголовок
				= НСтр("ru = 'Передача продукции давальцу увеличивается на перепоставленную продукцию с последующим оформлением поступления перепоставленной продукции';
						|en = 'Transfer of manufactured products to the provider increases by the quantity of overdelivered goods with the subsequent registration of a new receipt of overdelivered goods'");
		КонецЕсли;
		
		Элементы.ПерепоставленноеДаритсяДекорация.Заголовок  = НСтр("ru = 'Перепоставленная продукция не возвращается на склад, документы не переоформляются';
																	|en = 'Overdelivered goods are not returned to the warehouse. The documents are not reregistered'");
		Элементы.ОприходоватьСейчасДекорация.Заголовок       = НСтр("ru = 'Перепоставленная продукция возвращается на склад, документы не переоформляются';
																	|en = 'Overdelivered goods are returned to the warehouse. The documents are not reregistered'");
		
	ИначеЕсли ТипАкта = Перечисления.ТипыОснованияАктаОРасхождении.ВозвратДавальцу Тогда
		
		// Недостачи
		Элементы.ДекорацияНедостачиСогласованы.Заголовок     = НСтр("ru = 'Недостачи при возврате сырья согласованы с давальцем';
																	|en = 'Shortage at return of raw materials is approved with the provider'");
		Элементы.ДекорацияНедостачиНеСогласованы.Заголовок   = НСтр("ru = 'Недостачи при возврате сырья не согласованы с давальцем';
																	|en = 'Shortage at return of raw materials is not approved with the provider'");
		
		Если СпособОтраженияРасхождений = Перечисления.СпособыОтраженияРасхожденийАктПриемкиКлиента.ОформлениеКорректировкиКакИсправлениеПервичныхДокументов Тогда
			Элементы.ДопоставкаНеТребуетсяДекорация.Заголовок
				= НСтр("ru = 'На недопоставленное сырье оформляется возврат давальцу (исправление)';
						|en = 'For underdelivered raw materials, return to the provider is registered (correction)'");
			Элементы.ТребуетсяДопоставкаДекорация.Заголовок
				= НСтр("ru = 'На недопоставленное сырье оформляется возврат давальцу (исправление) с последующим оформлением нового возврата недопоставленного сырья';
						|en = 'For underdelivered raw materials, return to provider (correction) is registered, and a new return of underdelivered raw materials is registered'");
		Иначе
			Элементы.ДопоставкаНеТребуетсяДекорация.Заголовок
				= НСтр("ru = 'Возврат сырья давальцу уменьшается на недопоставленное сырье';
						|en = 'Return of raw materials to the provider is reduced by the quantity of undelivered raw materials'");
			Элементы.ТребуетсяДопоставкаДекорация.Заголовок
				= НСтр("ru = 'Возврат сырья давальцу уменьшается на недопоставленное сырье с последующим оформлением нового возврата недопоставленного сырья';
						|en = 'Return of raw materials to the provider is reduced by the quantity of undelivered raw materials with the subsequent registration of a new return of undelivered raw materials'");
		КонецЕсли;
		
		Элементы.НедостачаНеПризнанаДекорация.Заголовок      = НСтр("ru = 'Недопоставленное сырье не отгружается со склада, документы не переоформляются';
																	|en = 'Undelivered raw materials are not shipped from the warehouse. The documents are not reregistered'");
		Элементы.ОтгрузитьСейчасДекорация.Заголовок          = НСтр("ru = 'Недопоставленное сырье отгружается со склада, документы не переоформляются';
																	|en = 'Undelivered raw materials are shipped from the warehouse. The documents are not reregistered'");
		
		// Излишки
		Элементы.ДекорацияИзлишкиСогласованы.Заголовок       = НСтр("ru = 'Излишки при возврате сырья согласованы с давальцем';
																	|en = 'Surplus at return of raw materials is approved with the provider'");
		Элементы.ДекорацияИзлишкиНеСогласованы.Заголовок     = НСтр("ru = 'Излишки при возврате сырья не согласованы с давальцем';
																	|en = 'Surplus at return of raw materials is not approved with the provider'");
		
		Если СпособОтраженияРасхождений = Перечисления.СпособыОтраженияРасхожденийАктПриемкиКлиента.ОформлениеКорректировкиКакИсправлениеПервичныхДокументов Тогда
			Элементы.ПокупкаПерепоставленногоДекорация.Заголовок
				= НСтр("ru = 'На перепоставленное сырье оформляется возврат давальцу (исправление)';
						|en = 'For overdelivered raw materials, a return to the provider (correction) is registered'");
			Элементы.ВозвратПерепоставленногоДекорация.Заголовок
				= НСтр("ru = 'На перепоставленное сырье оформляется возврат давальцу (исправление) с последующим оформлением поступления перепоставленного сырья';
						|en = 'For overdelivered raw materials, a return to the provider (correction) is registered, and a new overdelivered goods receipt is registered'");
		Иначе
			Элементы.ПокупкаПерепоставленногоДекорация.Заголовок
				= НСтр("ru = 'Возврат сырья давальцу увеличивается на перепоставленное сырье';
						|en = 'Return of raw materials to the provider increases by the quantity of overdelivered raw materials'");
			Элементы.ВозвратПерепоставленногоДекорация.Заголовок
				= НСтр("ru = 'Возврат сырья давальцу увеличивается на перепоставленное сырье с последующим оформлением поступления перепоставленного сырья';
						|en = 'Return of raw materials to the provider increases by the quantity of overdelivered raw materials with the subsequent registration of overdelivered raw material receipt'");
		КонецЕсли;
		
		Элементы.ПерепоставленноеДаритсяДекорация.Заголовок  = НСтр("ru = 'Перепоставленное сырье не возвращается на склад, документы не переоформляются';
																	|en = 'Overdelivered raw materials are not returned to the warehouse. The documents are not reregistered'");
		Элементы.ОприходоватьСейчасДекорация.Заголовок       = НСтр("ru = 'Перепоставленное сырье возвращается на склад, документы не переоформляются';
																	|en = 'Overdelivered raw materials are returned to the warehouse. The documents are not reregistered'");
		
	//-- НЕ УТКА
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Ответ = РезультатВопроса;
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ВыполняетсяЗакрытие = Истина;
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
